export default function QuizIntro( { setStarted } : { setStarted:(value:boolean)=> void } ) {

    return (
        <>
            <div className="space-y-4">
                <p className="text-lg">
                    في هذا الاختبار القصير ستتعرّف على مجموعة من المفاهيم الأساسية في
                    علم الجبر، حيث سنقوم باختبار قدرتك على التعامل مع المتغيرات، تبسيط
                    التعابير الجبرية، وإيجاد قيمة المجاهيل من خلال حل المعادلات البسيطة.
                    سيساعدك هذا الاختبار أيضًا على فهم كيفية التمييز بين التعابير
                    والمعادلات، إضافةً إلى تطبيق المهارات في مسائل عملية سريعة. الأسئلة
                    صُممت لتكون مباشرة وتناسب المستوى التمهيدي، وهي فرصة رائعة لمراجعة
                    ما تعلّمته خلال المحاضرة. الهدف من هذا الكويز هو التأكد من استيعابك
                    للمفاهيم الرئيسية قبل الانتقال إلى موضوعات أكثر تقدّمًا في الجبر.
                </p>
                <button
                    onClick={() => setStarted(true)}
                    className="w-full p-3 bg-emerald-100 text-emerald-900 font-bold border-2 border-b-4 border-l-4 rounded-md hover:bg-emerald-200"
                >
                    ابدأ الاختبار
                </button>
            </div>
        </>
    )
}